# Before you start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [12]:
# import numpy and pandas
import pandas as pd
import numpy as np
import scipy.stats as st
from scipy.stats import ttest_1samp

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents. Please, load the data using Ironhack's database (db: employees, table: employees_advanced).

In [3]:
data = pd.read_csv('Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [4]:
# Your code here:
data.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [5]:
data.isnull().sum()/len(data)

Name                 0.00000
Job Titles           0.00000
Department           0.00000
Full or Part-Time    0.00000
Salary or Hourly     0.00000
Typical Hours        0.75862
Annual Salary        0.24138
Hourly Rate          0.75862
dtype: float64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [8]:
data['Salary or Hourly'].value_counts(dropna=False)

Salary    24775
Hourly     7883
Name: Salary or Hourly, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [9]:
data['Department'].value_counts(dropna=False)

POLICE                   12973
FIRE                      4800
STREETS & SAN             2194
OEMC                      2044
WATER MGMNT               1878
AVIATION                  1612
TRANSPORTN                1103
GENERAL SERVICES           972
PUBLIC LIBRARY             932
FAMILY & SUPPORT           621
FINANCE                    575
HEALTH                     516
LAW                        405
CITY COUNCIL               400
BUILDINGS                  266
COMMUNITY DEVELOPMENT      214
BUSINESS AFFAIRS           168
BOARD OF ELECTION          112
DoIT                       101
PROCUREMENT                 86
MAYOR'S OFFICE              85
CITY CLERK                  85
CULTURAL AFFAIRS            76
ANIMAL CONTRL               73
HUMAN RESOURCES             68
INSPECTOR GEN               63
IPRA                        56
BUDGET & MGMT               44
ADMIN HEARNG                38
DISABILITIES                29
TREASURER                   24
COPA                        17
HUMAN RELATIONS             17
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Department, dtype: int64

# Challenge 2 - Hypothesis Tests

### In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [15]:
hourly=data[data['Salary or Hourly']=='Hourly']
hourly.dtypes #need to transfer hourly rate into a numerical float

Name                  object
Job Titles            object
Department            object
Full or Part-Time     object
Salary or Hourly      object
Typical Hours        float64
Annual Salary         object
Hourly Rate           object
dtype: object

In [17]:
hourly.head(2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
11,"FITCH, JORDAN M",LAW CLERK,LAW,F,Hourly,35.0,NaN,$14.51
54,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,$19.66

In [19]:
hourly['Hourly Rate'] = hourly['Hourly Rate'].str.replace('$', '') #remove doller sign first

<ipython-input-19-db34c3fda9f8>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  hourly['Hourly Rate'] = hourly['Hourly Rate'].str.replace('$', '') #remove doller sign first
<ipython-input-19-db34c3fda9f8>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hourly['Hourly Rate'] = hourly['Hourly Rate'].str.replace('$', '') #remove doller sign first

In [20]:
hourly['Hourly Rate'] = hourly['Hourly Rate'].astype('float64')

<ipython-input-20-a0535c34d882>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hourly['Hourly Rate'] = hourly['Hourly Rate'].astype('float64')

In [22]:
hourly.dtypes #hourly rate is now a float

Name                  object
Job Titles            object
Department            object
Full or Part-Time     object
Salary or Hourly      object
Typical Hours        float64
Annual Salary         object
Hourly Rate          float64
dtype: object

In [24]:
stat, pval = ttest_1samp(hourly['Hourly Rate'], 30) #using t-test

In [26]:
print('stat is  ', stat)
print('pvalue for the two-tailed test is ', pval) # we want to look at two-tailed test

#p-value is extremly low, therefore we reject the null hypothesis (which waas mean is equal to 30
#since the test is two sided it doesnt matter if the stat value is postive or negative
# so overall we assume that the actual mean is different from 30 dollers per hour

stat is   21.003532193332216
pvalue for the two-tailed test is  2.4048011351057683e-95
pvalue for the one-tailed test is  1.2024005675528841e-95

In [28]:
sample_mean=np.mean(hourly['Hourly Rate']) # just to check whats the actual mean
sample_mean

32.86819231257292

### We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [32]:
#transform annual salary also to a float its an object now
data['Annual Salary'] = data['Annual Salary'].str.replace('$', '') #remove doller sign first
data['Annual Salary'] = data['Annual Salary'].astype('float64')
data.dtypes

<ipython-input-32-5ce6c530d44e>:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  data['Annual Salary'] = data['Annual Salary'].str.replace('$', '') #remove doller sign first

Name                  object
Job Titles            object
Department            object
Full or Part-Time     object
Salary or Hourly      object
Typical Hours        float64
Annual Salary        float64
Hourly Rate           object
dtype: object

In [37]:
Police=data[(data['Department']=='POLICE') & (data['Salary or Hourly']=='Salary')] #filter for policemen and salaried workers
Police

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,104628.0,NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,111474.0,NaN
7,"ELKINS, ERIC J",SERGEANT,POLICE,F,Salary,NaN,104628.0,NaN
8,"ESTRADA, LUIS F",POLICE OFFICER,POLICE,F,Salary,NaN,96060.0,NaN
9,"EWING, MARIE A",CLERK III,POLICE,F,Salary,NaN,53076.0,NaN
...,...,...,...,...,...,...,...,...
32652,"ZYGMUNT, DAWID",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN

In [38]:
stat, pval = ttest_1samp(Police['Annual Salary'], 86000) #using t-test

print('stat is  ', stat)

print('pvalue for the one-tailed test is ', pval/2)

#p-value is extremly low, 
#the stat value is positive, which means the sample mean is larger than the given mean value of 86000
#the null hypothesis is salary is equal or lower than 86000

# we reject the null hypothesis
# so we assume that the actual mean of the salary is higher than 86000 dollers per year which is the alternative hypothesis

stat is   12.573116980151957
pvalue for the one-tailed test is  2.4100985740030478e-36

#### Using the `crosstab` function, find the department that has the most hourly workers.

In [44]:
data_crosstab = pd.crosstab(data['Department'], data['Salary or Hourly']=='Hourly', margins = False)
data_crosstab
#streets and san has the highest number of hourly workers= 1873

Salary or Hourly       False  True
Department
ADMIN HEARNG              38      0
ANIMAL CONTRL             57     16
AVIATION                 556   1056
BOARD OF ELECTION        112      0
BOARD OF ETHICS            8      0
BUDGET & MGMT             43      1
BUILDINGS                266      0
BUSINESS AFFAIRS         160      8
CITY CLERK                82      3
CITY COUNCIL             348     52
COMMUNITY DEVELOPMENT    210      4
COPA                      17      0
CULTURAL AFFAIRS          66     10
DISABILITIES              29      0
DoIT                     101      0
FAMILY & SUPPORT         321    300
FINANCE                  532     43
FIRE                    4798      2
GENERAL SERVICES         205    767
HEALTH                   512      4
HUMAN RELATIONS           17      0
HUMAN RESOURCES           67      1
INSPECTOR GEN             63      0
IPRA                      56      0
LAW                      361     44
LICENSE APPL COMM          1      0
MAYOR'S OFFICE            78      7
OEMC                     832   1212
POLICE                 12941     32
POLICE BOARD               2      0
PROCUREMENT               82      4
PUBLIC LIBRARY           708    224
STREETS & SAN            321   1873
TRANSPORTN               396    707
TREASURER                 23      1
WATER MGMNT              366   1512

#### The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [47]:
#earlier i didnt transform hourly rate in the data as a float but in a spereate dataframe
#do it now in data dataframe
data['Hourly Rate'] = data['Hourly Rate'].str.replace('$', '') #remove doller sign first
data['Hourly Rate'] = data['Hourly Rate'].astype('float64')
data.dtypes

<ipython-input-47-422c149e5b93>:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  data['Hourly Rate'] = data['Hourly Rate'].str.replace('$', '') #remove doller sign first

Name                  object
Job Titles            object
Department            object
Full or Part-Time     object
Salary or Hourly      object
Typical Hours        float64
Annual Salary        float64
Hourly Rate          float64
dtype: object

In [48]:
Streets=data[(data['Department']=='STREETS & SAN') & (data['Salary or Hourly']=='Hourly')] #filter for streets and san and hourly workers
Streets.head(2)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
57,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
73,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,20.77

In [49]:
stat, pval = ttest_1samp(Streets['Hourly Rate'], 35) #using t-test

print('stat is  ', stat)

print('pvalue for the one-tailed test is ', pval/2)


#p value is below 0.05 therefore we reject the null hypothesis
#null hypothesis stated that H0: mean salary value >= 35

#so we assume the salary is below 35 and the complaints of the workers are valid as they stated them

stat is   -7.172610090911691
pvalue for the one-tailed test is  5.276243152130208e-13

# Challenge 3: To practice - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [53]:
#i still have my hourly dataframe with all hourly workers from previously
import scipy.stats
confidence_level = 0.95
degrees_freedom = len(hourly['Hourly Rate']) - 1  
sample_standard_error = scipy.pstats.sem(hourly['Hourly Rate']) 
sample_mean=np.mean(hourly['Hourly Rate']) 

confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)
print( 'confidence interval is ', confidence_interval, '.' )
#this shows clearly  that the mean with the confidence intervals included is not reaching 30 dollers per hour, for our sample with a 95% chance between 32.6 and 33.1

confidence interval is  (32.60050319432687, 33.135881430818976) .

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [57]:
#I still have my police variable from before
# i assume for the salarie payed police we look at the annual salaray since the hourly rate is Nan
confidence_level = 0.95
degrees_freedom = len(Police['Annual Salary']) - 1  
sample_standard_error = scipy.stats.sem(Police['Annual Salary']) 
sample_mean=np.mean(Police['Annual Salary']) 


confidence_interval = scipy.stats.t.interval(confidence_level, 
                                             degrees_freedom, 
                                             sample_mean, 
                                             sample_standard_error)
print( 'confidence interval is ', confidence_interval, '.' )

#for our sample with a 95% chance the annual sallary is between 87,549 $ and 88,122 $

confidence interval is  (87549.78923170577, 88122.26146607645) .

# Bonus Challenge - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [13]:
# Your code here: